"""
Задача №4
Користувач вводить рядок, в якому можуть бути присутні пропуски. 
Визначити, чи є рядок паліндромом, тобто таким, який однаково читається як справа наліво, 
так і зліва направо. Для літер регістр не враховувати. 
Приклади рядків-паліндромів: racecar, 10201, Ada, Never odd or even.


Автор: КАСЬЯН М.А.

"""
def is_palindrome(input_str):
    # Видаляємо пропуски і переводимо все до нижнього регістру
    cleaned_str = ''.join(input_str.split()).lower()
    
    # Перевірка, чи рядок є паліндромом
    return cleaned_str == cleaned_str[::-1]

# Зчитуємо рядок від користувача
user_input = input("Введіть рядок: ")

# Перевіряємо, чи є введений рядок паліндромом
if is_palindrome(user_input):
    print("Цей рядок - паліндром.")
else:
    print("Цей рядок не є паліндромом.")
