"""
Задача №1 
Мама спекла пиріг з яблуками, в якому було 60% яблук, 
а решта - тісто. При цьому 30% тіста становили яйця і цукор, 
решта - борошно. Вся маса пирога дорівнює m кг. Яка маса борошна в пирозі в грамах?

Автор: КАСЬЯН М.А.

"""
masa_piroga = float(input("Введіть масу пирога в кг: "))

# Обчислення маси яблук
apple_masa = 0.6 * masa_piroga

# Обчислення маси тіста
dough_masa = 0.4 * masa_piroga

# Обчислення маси яєць і цукру
egg_sugar_masa = 0.3 * masa_piroga

# Обчислення маси борошна
flour_masa = dough_masa - egg_sugar_masa

# Перетворення маси борошна в грами
flour_masa_grams = flour_masa * 1000

# Виведення результату
print("Маса борошна в пирозі: ",  flour_masa_grams)
